Vulnerability Test Results/artillery-load-test.yml
config:
  target: "http://localhost:8080/api"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: "Ramp up load to 100 VUs"
  defaults:
    headers:
      content-type: "application/json"

scenarios:
  - name: "Browse Mechanics & Request Status"
    flow:
      - get:
          url: "/mechanics/nearby?lat=12.9716&lng=77.5946&radius=25.0"
      - post:
          url: "/auth/login"
          json:
            email: "customer@test.com"
            password: "password123"
